[Killed] ArrowFunction
main/pages/Articles/ArticlesCreatePage.js:9:31
 import { toast } from "react-toastify";
 
 export default function ArticlesCreatePage({ storybook = false }) {
-  const objectToAxiosParams = (ucsbArticles) => ({
-    url: "/api/ucsbarticles/post",
-    method: "POST",
-    params: {
-      title: ucsbArticles.title,
-      url: ucsbArticles.url,
-      explanation: ucsbArticles.explanation,
-      email: ucsbArticles.email,
-      dateAdded: ucsbArticles.dateAdded,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (ucsbArticles) => {
killedBy: ArticlesCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BlockStatement
main/pages/Articles/ArticlesCreatePage.js:21:39
     },
   });
 
-  const onSuccess = (ucsbArticles) => {
-    toast(
-      `New ucsbArticles Created - id: ${ucsbArticles.id} title: ${ucsbArticles.title}`,
-    );
-  };
+  const onSuccess = (ucsbArticles) => {};
 
   const mutation = useBackendMutation(
killedBy: ArticlesCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New ucsbArticles Created - id: 17 title: Vegetables Are Better Than Fruits"

Number of calls: 0
