[Killed] BooleanLiteral
main/pages/Articles/ArticlesEditPage.js:8:60
 import { useBackend, useBackendMutation } from "main/utils/useBackend";
 import { toast } from "react-toastify";
 
-export default function UCSBArticlesEditPage({ storybook = false }) {
+export default function UCSBArticlesEditPage({ storybook = true }) {
   let { id } = useParams();
 
killedBy: ArticlesEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"to": "/ucsbarticles"}

Number of calls: 0

[Killed] ObjectLiteral
main/pages/Articles/ArticlesEditPage.js:18:5
   } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     [`/api/ucsbarticles?id=${id}`],
-    {
-      // Stryker disable next-line all : GET is the default, so changing this to "" doesn't introduce a bug
-      method: "GET",
-      url: `/api/ucsbarticles`,
-      params: {
-        id,
-      },
-    },
+    {},
   );
 
killedBy: ArticlesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="UCSBArticlesForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ArrowFunction
main/pages/Articles/ArticlesEditPage.js:28:34
     },
   );
 
-  const objectToAxiosPutParams = (ucsbArticles) => ({
-    url: "/api/ucsbarticles",
-    method: "PUT",
-    params: {
-      id: ucsbArticles.id,
-    },
-    data: {
-      title: ucsbArticles.title,
-      url: ucsbArticles.url,
-      explanation: ucsbArticles.explanation,
-      email: ucsbArticles.email,
-      dateAdded: ucsbArticles.dateAdded,
-    },
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (ucsbArticles) => {
killedBy: ArticlesEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "UCSBArticle Updated - id: 17 title: Fruits Are Better Than Veggies"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] StringLiteral
main/pages/Articles/ArticlesEditPage.js:29:10
   );
 
   const objectToAxiosPutParams = (ucsbArticles) => ({
-    url: "/api/ucsbarticles",
+    url: "",
     method: "PUT",
     params: {
killedBy: ArticlesEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "UCSBArticle Updated - id: 17 title: Fruits Are Better Than Veggies"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] ObjectLiteral
main/pages/Articles/ArticlesEditPage.js:31:13
   const objectToAxiosPutParams = (ucsbArticles) => ({
     url: "/api/ucsbarticles",
     method: "PUT",
-    params: {
-      id: ucsbArticles.id,
-    },
+    params: {},
     data: {
       title: ucsbArticles.title,
killedBy: ArticlesEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "id": 17,
- }

[Killed] ObjectLiteral
main/pages/Articles/ArticlesEditPage.js:34:11
     params: {
       id: ucsbArticles.id,
     },
-    data: {
-      title: ucsbArticles.title,
-      url: ucsbArticles.url,
-      explanation: ucsbArticles.explanation,
-      email: ucsbArticles.email,
-      dateAdded: ucsbArticles.dateAdded,
-    },
+    data: {},
   });
 
killedBy: ArticlesEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "{\"title\":\"Fruits Are Better Than Veggies\",\"url\":\"onion.com\",\"explanation\":\"Nutritional values about different produce\",\"email\":\"raymondchen@ucsb.edu\",\"dateAdded\":\"2022-01-02T12:00\"}"
Received: "{}"

[Killed] BlockStatement
main/pages/Articles/ArticlesEditPage.js:43:39
     },
   });
 
-  const onSuccess = (ucsbArticles) => {
-    toast(
-      `UCSBArticle Updated - id: ${ucsbArticles.id} title: ${ucsbArticles.title}`,
-    );
-  };
+  const onSuccess = (ucsbArticles) => {};
 
   const mutation = useBackendMutation(
killedBy: ArticlesEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] LogicalOperator
main/pages/Articles/ArticlesEditPage.js:70:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit UCSBArticle</h1>
-        {ucsbArticles && (
-          <UCSBArticlesForm
-            initialContents={ucsbArticles}
-            submitAction={onSubmit}
-            buttonLabel="Update"
-          />
-        )}
+        {ucsbArticles || <UCSBArticlesForm initialContents={ucsbArticles} submitAction={onSubmit} buttonLabel="Update" />}
       </div>
     </BasicLayout>
killedBy: ArticlesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Objects are not valid as a React child (found: object with keys {id, title, url, explanation, email, dateAdded}). If you meant to render a collection of children, use an array instead.

[Killed] ConditionalExpression
main/pages/Articles/ArticlesEditPage.js:70:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit UCSBArticle</h1>
-        {ucsbArticles && (
-          <UCSBArticlesForm
-            initialContents={ucsbArticles}
-            submitAction={onSubmit}
-            buttonLabel="Update"
-          />
-        )}
+        {false}
       </div>
     </BasicLayout>
killedBy: ArticlesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="UCSBArticlesForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
