[Killed] BlockStatement
main/pages/Articles/ArticlesIndexPage.js:12:30
 export default function UCSBArticlesIndexPage() {
   const currentUser = useCurrentUser();
 
-  const createButton = () => {
-    if (hasRole(currentUser, "ROLE_ADMIN")) {
-      return (
-        <Button
-          variant="primary"
-          href="/ucsbarticles/create"
-          style={{ float: "right" }}
-        >
-          Create Article
-        </Button>
-      );
-    }
-  };
+  const createButton = () => {};
 
   const {
killedBy: ArticlesIndexPage tests Renders with Create Button for admin user
statusReason: Error: Unable to find an element with the text: /Create Article/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BlockStatement
main/pages/Articles/ArticlesIndexPage.js:13:45
   const currentUser = useCurrentUser();
 
   const createButton = () => {
-    if (hasRole(currentUser, "ROLE_ADMIN")) {
-      return (
-        <Button
-          variant="primary"
-          href="/ucsbarticles/create"
-          style={{ float: "right" }}
-        >
-          Create Article
-        </Button>
-      );
-    }
+    if (hasRole(currentUser, "ROLE_ADMIN")) {}
   };
 
killedBy: ArticlesIndexPage tests Renders with Create Button for admin user
statusReason: Error: Unable to find an element with the text: /Create Article/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/pages/Articles/ArticlesIndexPage.js:18:27
         <Button
           variant="primary"
           href="/ucsbarticles/create"
-          style={{ float: "right" }}
+          style={{ float: "" }}
         >
           Create Article
killedBy: ArticlesIndexPage tests Renders with Create Button for admin user
statusReason: Error: expect(element).toHaveAttribute("style", "float: right;") // element.getAttribute("style") === "float: right;"

Expected the element to have attribute:
  style="float: right;"
Received:
  null

[Killed] ObjectLiteral
main/pages/Articles/ArticlesIndexPage.js:33:5
   } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     ["/api/ucsbarticles/all"],
-    { method: "GET", url: "/api/ucsbarticles/all" },
+    {},
     [],
   );
killedBy: ArticlesIndexPage tests renders three articles correctly for regular user
statusReason: Error: Unable to find an element by: [data-testid="UCSBArticlesTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/pages/Articles/ArticlesIndexPage.js:33:27
   } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     ["/api/ucsbarticles/all"],
-    { method: "GET", url: "/api/ucsbarticles/all" },
+    { method: "GET", url: "" },
     [],
   );
killedBy: ArticlesIndexPage tests renders three articles correctly for regular user
statusReason: Error: Unable to find an element by: [data-testid="UCSBArticlesTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
