[Killed] ArrowFunction
main/components/RecommendationRequest/RecommendationRequestTable.js:60:17
     },
     {
       Header: "Done",
-      accessor: (requests) => requests.done.toString(),
+      accessor: () => undefined,
     },
   ];
killedBy: RecommendationRequestTable tests Has the expected column headers and content for ordinary user
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  true
Received:
