[Survived] ArrowFunction
main/components/RecommendationRequest/RecommendationRequestTable.js:60:17
     },
     {
       Header: "Done",
-      accessor: (requests) => requests.done.toString()
+      accessor: () => undefined
     },
   ];
