[Killed] ObjectLiteral
main/components/HelpRequest/HelpRequestTable.js:58:5
       Header: "Explanation",
       accessor: "explanation",
     },
-    {
-      Header: "Solved",
-      accessor: "solved",
-    },
+    {},
   ];
 
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: A column ID (or string accessor) is required!
