[Killed] ArrayDeclaration
main/pages/HelpRequest/HelpRequestIndexPage.js:34:5
     // Stryker disable next-line all : don't test internal caching of React Query
     ["/api/helprequest/all"],
     { method: "GET", url: "/api/helprequest/all" },
-    [],
+    ["Stryker was here"],
   );
 
killedBy: HelpRequestIndexPage tests renders empty table when backend unavailable, user only
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <td data-testid="HelpRequestTable-cell-row-0-col-id" role="cell" /> instead
