[Killed] ObjectLiteral
main/components/HelpRequest/HelpRequestTable.js:58:5
       Header: "Explanation",
       accessor: "explanation",
     },
-    {
-      Header: "Solved",
-      accessor: (requests) => requests.solved.toString(),
-    },
+    {},
   ];
 
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ArrowFunction
main/components/HelpRequest/HelpRequestTable.js:60:17
     },
     {
       Header: "Solved",
-      accessor: (requests) => requests.solved.toString(),
+      accessor: () => undefined,
     },
   ];
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  false
Received:
