[Killed] LogicalOperator
main/components/UCSBArticles/UCSBArticlesForm.js:33:10
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
       <Row>
-        {initialContents && (
-          <Col>
-            <Form.Group className="mb-3">
-              <Form.Label htmlFor="id">Id</Form.Label>
-              <Form.Control
-                data-testid="UCSBArticlesForm-id"
-                id="id"
-                type="text"
-                {...register("id")}
-                value={initialContents.id}
-                disabled
-              />
-            </Form.Group>
-          </Col>
-        )}
+        {initialContents || <Col>
+            <Form.Group className="mb-3">
+              <Form.Label htmlFor="id">Id</Form.Label>
+              <Form.Control data-testid="UCSBArticlesForm-id" id="id" type="text" {...register("id")} value={initialContents.id} disabled />
+            </Form.Group>
+          </Col>}
 
         <Col>
killedBy: UCSBArticlesForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Killed] ConditionalExpression
main/components/UCSBArticles/UCSBArticlesForm.js:33:10
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
       <Row>
-        {initialContents && (
-          <Col>
-            <Form.Group className="mb-3">
-              <Form.Label htmlFor="id">Id</Form.Label>
-              <Form.Control
-                data-testid="UCSBArticlesForm-id"
-                id="id"
-                type="text"
-                {...register("id")}
-                value={initialContents.id}
-                disabled
-              />
-            </Form.Group>
-          </Col>
-        )}
+        {true}
 
         <Col>
killedBy: UCSBArticlesForm tests renders correctly when passing in a UCSBArticles
statusReason: Error: Unable to find an element by: [data-testid="/UCSBArticlesForm-id/"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/UCSBArticles/UCSBArticlesForm.js:58:27
               type="text"
               isInvalid={Boolean(errors.title)}
               {...register("title", {
-                required: "Title is required.",
+                required: "",
               })}
             />
killedBy: UCSBArticlesForm tests Correct Error messsages on missing input
statusReason: Error: Unable to find an element with the text: /Title is required/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] LogicalOperator
main/components/UCSBArticles/UCSBArticlesForm.js:135:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.dateAdded && "dateAdded is required. "}
+              {errors.dateAdded || "dateAdded is required. "}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: UCSBArticlesForm tests Correct Error messsages on missing input
statusReason: Error: Objects are not valid as a React child (found: object with keys {type, message, ref}). If you meant to render a collection of children, use an array instead.

[Killed] ConditionalExpression
main/components/UCSBArticles/UCSBArticlesForm.js:135:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.dateAdded && "dateAdded is required. "}
+              {false}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: UCSBArticlesForm tests Correct Error messsages on missing input
statusReason: Error: Unable to find an element with the text: /dateAdded is required/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
