[Killed] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:57:46
               id="requesterEmail"
               type="email"
               isInvalid={Boolean(errors.requesterEmail)}
-              {...register("requesterEmail", {
-                required: "Requester email is required.",
-              })}
+              {...register("requesterEmail", {})}
             />
             <Form.Control.Feedback type="invalid">
killedBy: RecommendationRequestForm tests Correct Error messsages on missing input
statusReason: Error: Unable to find an element with the text: /Requester email is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:75:27
               type="email"
               isInvalid={Boolean(errors.professorEmail)}
               {...register("professorEmail", {
-                required: "Professor email is required.",
+                required: "",
               })}
             />
killedBy: RecommendationRequestForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Professor email is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:129:42
               id="dateNeeded"
               type="datetime-local"
               isInvalid={Boolean(errors.dateNeeded)}
-              {...register("dateNeeded", {
-                required: "Local date time in ISO format required.",
-                pattern: isodate_regex,
-              })}
+              {...register("dateNeeded", {})}
             />
             <Form.Control.Feedback type="invalid">
killedBy: RecommendationRequestForm tests Correct Error messsages on missing input
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1
