[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.js:32:23
           type="text"
           isInvalid={Boolean(errors.orgField)}
           {...register("orgField", {
-            required: "Organization Field is required.",
+            required: "",
           })}
         />
killedBy: UCSBOrganizationForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /Organization Field is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] OptionalChaining
main/components/UCSBOrganization/UCSBOrganizationForm.js:36:12
           })}
         />
         <Form.Control.Feedback type="invalid">
-          {errors.orgField?.message}
+          {errors.orgField.message}
         </Form.Control.Feedback>
       </Form.Group>
killedBy: UCSBOrganizationForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading 'message')
