[Killed] BlockStatement
main/components/UCSBOrganization/UCSBOrganizationTable.js:18:34
   testIdPrefix = "OrganizationTable",
 }) {
   const navigate = useNavigate();
-  const editCallback = (cell) => {
-    navigate(`/organizations/edit/${cell.row.values.orgField}`);
-  };
+  const editCallback = (cell) => {};
   // Stryker disable all : hard to test for query caching
   const deleteMutation = useBackendMutation(
killedBy: UCSBOrganizationTable tests Edit button navigates to the edit page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/organizations/edit/SKY"

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationTable.js:19:14
 }) {
   const navigate = useNavigate();
   const editCallback = (cell) => {
-    navigate(`/organizations/edit/${cell.row.values.orgField}`);
+    navigate(``);
   };
   // Stryker disable all : hard to test for query caching
killedBy: UCSBOrganizationTable tests Edit button navigates to the edit page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/organizations/edit/SKY"
Received: ""

Number of calls: 1

Ignored nodes: comments, script, style

[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationTable.js:34:15
   };
   const columns = [
     {
-      Header: "Organization Field",
+      Header: "",
       accessor: "orgField", // accessor is the "key" in the data
     },
killedBy: UCSBOrganizationTable tests renders empty table correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: Organization Field. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] ArrowFunction
main/components/UCSBOrganization/UCSBOrganizationTable.js:48:17
     {
       Header: "Inactive",
       // for boolean
-      accessor: (organizations) => organizations.inactive.toString(),
+      accessor: () => undefined,
     },
   ];
killedBy: UCSBOrganizationTable tests Has the expected column headers, content and buttons for admin user
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  false
Received:

[Killed] ConditionalExpression
main/components/UCSBOrganization/UCSBOrganizationTable.js:51:7
       accessor: (organizations) => organizations.inactive.toString(),
     },
   ];
-  if (hasRole(currentUser, "ROLE_ADMIN")) {
+  if (true) {
     columns.push(ButtonColumn("Edit", "primary", editCallback, testIdPrefix));
     columns.push(
killedBy: UCSBOrganizationTable tests Has the expected column headers, content and buttons for ordinary user
statusReason: TestingLibraryElementError: Found multiple elements with the text: Delete

Here are the matching elements:

Ignored nodes: comments, script, style
<th
  colspan="1"
  data-testid="OrganizationTable-header-Delete"

[Killed] ConditionalExpression
main/components/UCSBOrganization/UCSBOrganizationTable.js:51:7
       accessor: (organizations) => organizations.inactive.toString(),
     },
   ];
-  if (hasRole(currentUser, "ROLE_ADMIN")) {
+  if (false) {
     columns.push(ButtonColumn("Edit", "primary", editCallback, testIdPrefix));
     columns.push(
killedBy: UCSBOrganizationTable tests Has the expected column headers, content and buttons for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="OrganizationTable-cell-row-0-col-Edit-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
